app/controllers/api/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."author_id" = $1  [["author_id", 7]]
---
  def index
    @lists = List.all.where(author_id: current_user.id)

INSERT INTO "lists" ("title", "author_id", "id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new list"], ["author_id", 7], ["id", 0], ["created_at", "2017-01-17 00:13:36.003038"], ["updated_at", "2017-01-17 00:13:36.003038"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "test list to be deleted"], ["updated_at", "2017-01-13 19:53:52.537526"], ["id", 2]]
---
  def update
    @list = List.find(params[:id])
    if @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 2]]
---
  def destroy
    @list = current_user.lists.find(params[:id])
    @list.destroy